export const FILLING_BID_WIZARD = 'filling-bid';

enum Belong {
  M = 'Мужской',
  W = 'Женский',
  C = 'Общий',
}

export const MODERATORS = {
  ['ГК']: 'MAIN_MODERATOR_ID',
  ['ЗП']: 'ZP_MODERATOR_ID',
};

export const ROOMS_LIST = {
  ['ГК']: {
    '1 этаж': {
      [Belong.M]: ['Атриум', 'Мужская раздевалка'],
      [Belong.W]: ['Атриум', 'Женская раздевалка'],
      [Belong.C]: ['109, возле преподавательской', '112, возле типографии'],
    },
    '2 этаж': {
      [Belong.M]: ['Атриум'],
      [Belong.W]: ['248, правое крыло', '228, атриум', '214, левое крыло'],
      [Belong.C]: ['Общий'],
    },
    '3 этаж': {
      [Belong.M]: ['344, атриум', '352, правое крыло'],
      [Belong.W]: ['Атриум', '314, левое крыло', '321, правое крыло'],
    },
    '4 этаж': {
      [Belong.M]: ['408'],
      [Belong.C]: ['428'],
    },
    '5 этаж': {
      [Belong.M]: ['512, левое крыло', '54', '56'],
      [Belong.W]: ['508, левое крыло', '528, правое крыло', '55'],
    },
    '6 этаж': {
      [Belong.C]: ['Возле 606, левое крыло', '615, правое крыло'],
    },
  },
  /*['ЗП']: {
    '1 этаж': {
      [Belong.M]: ['Возле 106'],
      [Belong.W]: ['Возле 105'],
      [Belong.C]: ['119', '110'],
    },
    '2 этаж': {
      [Belong.M]: ['Возле 205'],
      [Belong.W]: ['Возле 204'],
    },
    '3 этаж': {
      [Belong.M]: ['Возле 305'],
      [Belong.W]: ['Возле 304'],
    },
    '4 этаж': {
      [Belong.M]: ['В мужской раздевалке'],
      [Belong.W]: ['В женской раздевалке'],
      [Belong.C]: ['Возле мужской раздевалки'],
    },
  },*/
};
