export const FILLING_BID_WIZARD = 'filling-bid';

export const ROOMS_LIST = {
  '1 этаж': {
    ['Мужской']: ['Атриум', 'Мужская раздевалка'],
    ['Женский']: ['Атриум', 'Женская раздевалка'],
    ['Общий']: ['109, возле преподавательской', '112, возле типографии'],
  },
  '2 этаж': {
    ['Мужской']: ['Атриум'],
    ['Женский']: ['248, правое крыло', '228, атриум', '214, левое крыло'],
    ['Общий']: ['Общий'],
  },
  '3 этаж': {
    ['Мужской']: ['344, атриум', '352, правое крыло'],
    ['Женский']: ['Атриум', '314, левое крыло', '321, правое крыло'],
  },
  '4 этаж': {
    ['Мужской']: ['408'],
    ['Общий']: ['428'],
  },
  '5 этаж': {
    ['Мужской']: ['512, левое крыло', '54', '56'],
    ['Женский']: ['508, левое крыло', '528, правое крыло', '55'],
  },
  '6 этаж': {
    ['Общий']: ['Возле 606, левое крыло', '615, правое крыло'],
  },
};
